## Проект "Магнит.Доставка", команда Order Management System (OMS)
TeamLead / Ведущий разработчик

Первый долгосрочный успешный опыт лидинга на highload проекте.
Пройдено много этапов и вех развития продукта, ротация руководства и членов команды, большой размер команды.

## Основные обязанности:
- code review
- build, deploy релизов
- hotfix

- проработка backlog (анализ, тех. ревью, декомпозиция, оценка, распределение)
- one-to-one (вопросы по задачам, организационные, технические)

- коммуникации с бизнесом, аналитикой и разработкой
- onboarding

## Достижения
- Внедрена практика Release Meet. 
Еженедельный синк с командой, где каждый рассказывает про свои задачи прошедших релизов. Обсуждаются новости, инциденты, решаются вопросы.
Отлично решает вопросы осведомленности команды об изменениях кодовой базы, текущих задачах, проблемах и способах решения.
Практика внедрена более года назад и продолжает действовать.

- Серия докладов о Жизненном цикле заказа.
Набор из 7 лекций с рассказом об основной зоне ответственности команды с т. з. бизнеса и техники.
Лекции служат отличным материалом для онбординга новых сотрудников, а также освещения изменений для всей команды.

- Разделение на виртуальные команды по зонам ответственности.
После достижения критического размера команды, провели разбиение на 3 виртуальные команды: заказ, возврат и core.
В каждой команде был Sub Lead, отвечающий за ревью, аналитику, сборку релизов и др. в рамках выделенной зоны ответственности.
Практика позволила избавиться от узкого горлышка в виде одного team lead при большом размере команды и зоны ответственности.

- Практика "Не оставляй работу в тени"
Практика, при которой team lead уделяет особое внимание деятельности отдельных членов команды.
Обязательно подсвечивает факт и значимость решенной сотрудником задачи.
Цель - повышение мотивации разработчика.

## Используемые технологии:
PHP 7, Symfony 4.3, Bitrix, Doctrine, MySQL, Kafka, RabbitMQ.

## Проект "Магнит.Доставка"
Backend PHP разработчик

- Реализовал PATCH API по сборке заказа.
Метод позволяет:
     - отменять заказ при пустой корзине.
     - обновлять количество товара.
     - добавлять и удалять замены с сохранением информации о замененном товаре.
     - обновлять статус и мета данные заказа.
     - обновлять итоговую сумму заказа с использованием корректирующей бизнес-логики.

Метод претерпел некоторые изменения, расширение функциональности в ходе жизненного цикла проекта, однако
Базовая механика API сохранилась и успешно работает уже около 3 лет.
 
- Реализовал разделение статусной модели заказа в условиях соседства с другим интернет-магазином в рамках монолита.
- Реализовал API управления адресами клиента.

В отличие от предыдущего опыта работы, я сфокусировался на одном проекте в условиях продуктовой разработки.

## Используемые технологии:  
PHP 7, Symfony 4.3, Bitrix, Doctrine, MySQL.
